Catalogs/бит_рз_ХранилищеДополнительнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_рз_ХранилищеДополнительнойИнформации</Name>
			<Comment>Хранилище дополнительной информации (Реестр замечаний)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДанных</Name>
					<Comment>Вид данных</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_рз_ВидыДополнительнойИнформацииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_РазовыеПоУслугамЖКХ</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_УстановкаСтавокПоУслугам</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_РаспределениеОплатыПоПоставщикам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/бит_рз_ВидыДополнительнойИнформацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_рз_ВидыДополнительнойИнформацииОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_рз_ХранилищеДополнительнойИнформации/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Элементы.Объект.ТолькоПросмотр = НеРедактироватьОбъект;
	
	Если ЗначениеЗаполнено(Объект.ИмяФайла) Тогда
		ТекстСтатус = НСтр("ru = 'Файл загружен'");
	Иначе
		ТекстСтатус = НСтр("ru = 'Файл не загружен'");
	КонецЕсли;
	
	Элементы.ИнформацияСтатус.Заголовок = "   " + ТекстСтатус;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью" формы.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Объект) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Объект"" не заполнено'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения, Объект, "Объект.Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписьюНаСервере" формы.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Получить файл из хранилища и поместить его в объект.
	Если ЭтоАдресВременногоХранилища(СсылкаНаФайлВоВременномХранилище) Тогда
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(СсылкаНаФайлВоВременномХранилище);
		
		ТекущийОбъект.Хранилище = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
		ТекущийОбъект.ИмяФайла  = ИмяФайла;
		ТекущийОбъект.ВидДанных = Перечисления.бит_рз_ВидыДополнительнойИнформацииОбъектов.Файл;
		
	КонецЕсли;
	
КонецПроцедуры	

// Процедура - обработчик события "ПриЗаписиНаСервере" формы.
//
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Удалить файл из временного хранилища.
	Если ЭтоАдресВременногоХранилища(СсылкаНаФайлВоВременномХранилище) Тогда
		УдалитьИзВременногоХранилища(СсылкаНаФайлВоВременномХранилище);
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

// Процедура - обработчик команды "ОткрытьФайл" формы.
//
&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	бит_ХранениеДополнительнойИнформацииКлиент.ОткрытьФайл(Объект.Ссылка, Объект.ИмяФайла);	
	
КонецПроцедуры

// Процедура - обработчик команды "СохранитьФайл" формы.
//
&НаКлиенте
Процедура СохранитьФайл(Команда)
	
	бит_ХранениеДополнительнойИнформацииКлиент.СохранитьФайл(Объект.Ссылка, Объект.ИмяФайла);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "НачалоВыбора" поля ввода "ИмяФайла".
// 
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПолноеИмяФайла = "";
	
	#Если Не ВебКлиент Тогда
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Каталог 					   = "";
		Диалог.Заголовок 				   = НСтр("ru = 'Выберите файл...'");
		Диалог.Фильтр 					   = бит_ХранениеДополнительнойИнформации.ПолучитьФильтрФайлов();
		Диалог.ПредварительныйПросмотр 	   = Истина;
		Диалог.ПроверятьСуществованиеФайла = Истина;
		Диалог.МножественныйВыбор 		   = Ложь;
		
		Если Не Диалог.Выбрать() Тогда
			Возврат;
		КонецЕсли;
		
		Попытка
			
			ДвоичныеДанные  = Новый ДвоичныеДанные(Диалог.ПолноеИмяФайла);
			АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
			
			СсылкаНаФайлВоВременномХранилище = АдресВХранилище;
			
			Объект.ИмяФайла = Сред(Диалог.ПолноеИмяФайла, СтрДлина(Диалог.Каталог) + 1);
			ПолноеИмяФайла  = Диалог.ПолноеИмяФайла;
			
		Исключение
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("" + ОписаниеОшибки(), Объект);
		КонецПопытки;
		
	#Иначе
		
		АдресВХранилище   = "";
		ВыбранноеИмяФайла = "";
		
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ИмяФайлаНачалоВыбораЗавершение1", ЭтотОбъект, Новый Структура("АдресВХранилище, ВыбранноеИмяФайла", АдресВХранилище, ВыбранноеИмяФайла)), АдресВХранилище,,,  УникальныйИдентификатор);
        Возврат;
		
	#КонецЕсли
	
	ИмяФайлаНачалоВыбораФрагмент(ПолноеИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбораЗавершение1(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
    
    АдресВХранилище = ДополнительныеПараметры.АдресВХранилище;
    
    
    Если Результат Тогда
        
        Файл = Новый Файл(ВыбранноеИмяФайла);
        
        Объект.ИмяФайла 				 = Файл.Имя;
        СсылкаНаФайлВоВременномХранилище = АдресВХранилище;
        
        ПолноеИмяФайла = ВыбранноеИмяФайла;
        
    КонецЕсли;
    
    
    ИмяФайлаНачалоВыбораФрагмент(ПолноеИмяФайла);

КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбораФрагмент(Знач ПолноеИмяФайла)
    
    Перем Ответ, РасширениеПодключено, РасширениеФайла;
    
    Если ПолноеИмяФайла = "" Тогда
        Возврат;
    КонецЕсли;
    
    ИмяФайла = Объект.ИмяФайла;
    
    Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
        
        РасширениеФайла 	= бит_ХранениеДополнительнойИнформации.ПолучитьРасширениеФайла(ИмяФайла);
        Объект.Наименование = СтрЗаменить(ИмяФайла, Прав(ИмяФайла, СтрДлина(РасширениеФайла) + 1), "");
        
    КонецЕсли;
    
    УправлениеЭлементамиФормы();
    
    Модифицированность = Истина;
    
    РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
    
    Если Не РасширениеПодключено Тогда
        Возврат;
    КонецЕсли;
    
    Ответ = Неопределено;
    
    
    ПоказатьВопрос(Новый ОписаниеОповещения("ИмяФайлаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ПолноеИмяФайла", ПолноеИмяФайла)), НСтр("ru = 'Удалить файл источник?'")
    ,РежимДиалогаВопрос.ДаНетОтмена
    ,
    ,КодВозвратаДиалога.Нет
    ,НСтр("ru = 'Удаление файла'"));

КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    ПолноеИмяФайла = ДополнительныеПараметры.ПолноеИмяФайла;
   
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Да Тогда
        
        Попытка
            УдалитьФайлы(ПолноеИмяФайла);
        Исключение
            бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("" + ОписаниеОшибки(), Объект);
        КонецПопытки;
        
    КонецЕсли;

КонецПроцедуры

#КонецОбласти
